data_assignment/foam_cases/6_deg_coarse/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   nonuniform List<scalar> 
19794
(
292.97635
292.97579
292.97779
292.98172
292.9854
292.98883
292.99131
292.99314
...
)
;

boundaryField
{
    Side
    {
        type            empty;
    }
    Inlet
    {
        type            freestream;
        freestreamValue uniform 293;
        value           nonuniform List<scalar> 
300
(
293
293
293
293
293
293
293
293
...
)
;
    }
    Outlet
    {
        type            zeroGradient;
    }
    Flap
    {
        type            zeroGradient;
    }
    Airfoil
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
