data_assignment/foam_cases/6_deg_coarse/0/TMean
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      TMean;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   nonuniform List<scalar> 
19794
(
292.97867
292.9773
292.97848
292.98085
292.98342
292.98622
292.98884
292.99118
...
)
;

boundaryField
{
    Side
    {
        type            empty;
    }
    Inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
300
(
293
293
293
293
293
293
293
293
...
)
;
    }
    Outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
135
(
293.03704
293.05315
293.06927
293.08495
293.09519
293.10406
293.1101
293.11493
...
)
;
    }
    Flap
    {
        type            calculated;
        value           nonuniform List<scalar> 
107
(
292.54392
292.80063
293.05807
293.40346
293.51407
293.67664
293.80403
293.85852
...
)
;
    }
    Airfoil
    {
        type            calculated;
        value           nonuniform List<scalar> 
176
(
294.42242
294.38585
294.31074
294.31879
294.35375
294.33071
294.35609
294.35357
...
)
;
    }
}


// ************************************************************************* //
