data_assignment/foam_cases/6_deg_coarse/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
19794
(
(63.461049 6.4112379 2.8417287e-18)
(63.426105 6.5352494 -3.7733937e-19)
(63.359094 6.6212374 7.9863159e-19)
(63.301968 6.6801064 1.2634026e-18)
(63.253416 6.7164159 0)
(63.215683 6.739027 -2.3183962e-18)
(63.187967 6.7506575 2.4211185e-18)
(63.167065 6.7538437 -2.0168967e-18)
...
)
;

boundaryField
{
    Side
    {
        type            empty;
    }
    Inlet
    {
        type            freestreamVelocity;
        freestreamValue uniform (63.144567 6.6367615 0);
        value           nonuniform List<vector> 
300
(
(63.26253 6.5527017 1.0592031e-18)
(63.239467 6.602544 -1.271927e-19)
(63.209815 6.6320398 2.429039e-19)
(63.187662 6.6486288 3.4590404e-19)
(63.171324 6.6563423 0)
(63.160219 6.6592696 -5.1026682e-19)
(63.153093 6.6591355 4.7560949e-19)
(63.148498 6.6572173 -3.5237793e-19)
...
)
;
    }
    Outlet
    {
        type            zeroGradient;
    }
    Flap
    {
        type            noSlip;
    }
    Airfoil
    {
        type            noSlip;
    }
}


// ************************************************************************* //
