data_assignment/foam_cases/6_deg_coarse/0/UMean
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      UMean;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
19794
(
(63.42489 6.3965259 8.9604427e-18)
(63.418697 6.5122903 -1.1895133e-18)
(63.376362 6.5943427 2.5170994e-18)
(63.334948 6.653575 3.9810455e-18)
(63.295683 6.693418 0)
(63.260955 6.7201376 -7.3020751e-18)
(63.231214 6.7369669 7.6244394e-18)
(63.206416 6.7466065 -6.3504168e-18)
...
)
;

boundaryField
{
    Side
    {
        type            empty;
    }
    Inlet
    {
        type            calculated;
        value           nonuniform List<vector> 
300
(
(63.248841 6.5484016 3.3425176e-18)
(63.236645 6.5956912 -4.0120355e-19)
(63.214762 6.6244795 7.6589401e-19)
(63.196447 6.6417678 1.0902647e-18)
(63.181541 6.6509379 0)
(63.17007 6.655261 -1.6074041e-18)
(63.161521 6.656534 1.4979734e-18)
(63.155336 6.6560054 -1.109662e-18)
...
)
;
    }
    Outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
135
(
(62.591047 6.500371 0)
(62.403237 6.6307468 -1.3634679e-21)
(62.274663 6.5967273 0)
(62.221073 6.6507849 -1.3630338e-21)
(62.183489 6.668543 0)
(62.162538 6.7024765 -1.3625625e-21)
(62.144987 6.7300207 0)
(62.131572 6.7623645 1.3620792e-21)
...
)
;
    }
    Flap
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    Airfoil
    {
        type            calculated;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
