data_assignment/foam_cases/6_deg_coarse/0/U_0
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      U_0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
19794
(
(63.461033 6.4112363 2.8417286e-18)
(63.426092 6.5352353 -3.7733935e-19)
(63.359088 6.6212136 7.9863157e-19)
(63.301972 6.6800761 1.2634026e-18)
(63.253426 6.7163819 0)
(63.215696 6.7389915 -2.3183962e-18)
(63.18798 6.7506262 2.4211185e-18)
(63.167079 6.753818 -2.0168968e-18)
...
)
;

boundaryField
{
    Side
    {
        type            empty;
    }
    Inlet
    {
        type            freestreamVelocity;
        freestreamValue uniform (63.144567 6.6367615 0);
        value           nonuniform List<vector> 
300
(
(63.262524 6.5527011 1.059203e-18)
(63.239463 6.6025393 -1.2719268e-19)
(63.209814 6.6320326 2.4290385e-19)
(63.187662 6.6486205 3.4590396e-19)
(63.171327 6.6563339 0)
(63.160222 6.6592618 -5.1026669e-19)
(63.153095 6.6591293 4.756094e-19)
(63.1485 6.6572128 -3.5237788e-19)
...
)
;
    }
    Outlet
    {
        type            zeroGradient;
    }
    Flap
    {
        type            noSlip;
    }
    Airfoil
    {
        type            noSlip;
    }
}


// ************************************************************************* //
