data_assignment/foam_cases/6_deg_coarse/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
19794
(
0.57147949
0.56946056
0.56780888
0.56683436
0.5661607
0.56575001
0.56549657
0.56533997
...
)
;

boundaryField
{
    Side
    {
        type            empty;
    }
    Inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
300
(
0.56344154
0.56351544
0.56359546
0.56367744
0.56375549
0.56383
0.56390408
0.56397569
...
)
;
    }
    Outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
135
(
1.3040652
1.0508762
0.83423138
0.72507631
0.69665135
0.69952092
0.71760613
0.75474999
...
)
;
    }
    Flap
    {
        type            compressible::alphatWallFunction;
        value           nonuniform List<scalar> 
107
(
0
0
0
0
0
0
0
0
...
)
;
    }
    Airfoil
    {
        type            compressible::alphatWallFunction;
        value           nonuniform List<scalar> 
176
(
7.7924697e-06
5.8414591e-06
4.2699414e-06
2.8106802e-06
1.5836911e-06
5.3910776e-07
0
0
...
)
;
    }
}


// ************************************************************************* //
