data_assignment/foam_cases/6_deg_coarse/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
19794
(
0.62327862
0.61841553
0.61443412
0.61199881
0.61027053
0.60915633
0.6084032
0.60788018
...
)
;

boundaryField
{
    Side
    {
        type            empty;
    }
    Inlet
    {
        type            inletOutlet;
        inletValue      uniform 0.605;
        value           nonuniform List<scalar> 
300
(
0.605
0.605
0.605
0.605
0.605
0.605
0.605
0.605
...
)
;
    }
    Outlet
    {
        type            zeroGradient;
    }
    Flap
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
107
(
11.694687
34.091189
20.619066
15.08774
13.257125
9.9129051
9.0916504
8.6705732
...
)
;
    }
    Airfoil
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
176
(
14.401828
12.362599
10.874388
9.7417124
8.8616041
8.0976555
7.5468019
7.1972077
...
)
;
    }
}


// ************************************************************************* //
