data_assignment/foam_cases/6_deg_coarse/0/k_0
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      k_0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
19794
(
0.62327725
0.61841475
0.6144337
0.61199864
0.6102705
0.60915634
0.60840321
0.60788018
...
)
;

boundaryField
{
    Side
    {
        type            empty;
    }
    Inlet
    {
        type            inletOutlet;
        inletValue      uniform 0.605;
        value           nonuniform List<scalar> 
300
(
0.605
0.605
0.605
0.605
0.605
0.605
0.605
0.605
...
)
;
    }
    Outlet
    {
        type            zeroGradient;
    }
    Flap
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
107
(
11.694391
34.090753
20.618908
15.087641
13.257059
9.912864
9.0916204
8.670551
...
)
;
    }
    Airfoil
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
176
(
14.401807
12.362583
10.874376
9.7417036
8.8615973
8.0976503
7.5467987
7.1972057
...
)
;
    }
}


// ************************************************************************* //
