data_assignment/foam_cases/6_deg_coarse/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
19794
(
0.47579356
0.4739965
0.47251513
0.47160881
0.47096514
0.47054989
0.47026906
0.47007395
...
)
;

boundaryField
{
    Side
    {
        type            empty;
    }
    Inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
300
(
0.46899225
0.46899225
0.46899225
0.46899225
0.46899225
0.46899225
0.46899225
0.46899225
...
)
;
    }
    Outlet
    {
        type            zeroGradient;
    }
    Flap
    {
        type            nutkWallFunction;
        value           nonuniform List<scalar> 
107
(
0
0
0
0
0
0
0
0
...
)
;
    }
    Airfoil
    {
        type            nutkWallFunction;
        value           nonuniform List<scalar> 
176
(
5.4374934e-06
4.075941e-06
2.9782111e-06
1.9603993e-06
1.1047491e-06
3.759955e-07
0
0
...
)
;
    }
}


// ************************************************************************* //
