data_assignment/foam_cases/6_deg_coarse/0/nutMean
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      nutMean;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
19794
(
0.48957764
0.48612371
0.48362545
0.48169117
0.48001655
0.47858945
0.4773621
0.47631086
...
)
;

boundaryField
{
    Side
    {
        type            empty;
    }
    Inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
300
(
0.46899225
0.46899225
0.46899225
0.46899225
0.46899225
0.46899225
0.46899225
0.46899225
...
)
;
    }
    Outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
135
(
0.59658371
0.54533164
0.51225014
0.4980111
0.49330662
0.49250912
0.49292457
0.49423054
...
)
;
    }
    Flap
    {
        type            calculated;
        value           nonuniform List<scalar> 
107
(
0
0
0
0
0
0
0
0
...
)
;
    }
    Airfoil
    {
        type            calculated;
        value           nonuniform List<scalar> 
176
(
4.6754256e-06
3.4954058e-06
2.5213792e-06
1.6031081e-06
8.4061251e-07
3.9524566e-07
2.3260819e-07
1.9724402e-07
...
)
;
    }
}


// ************************************************************************* //
