data_assignment/foam_cases/6_deg_coarse/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
19794
(
1.309977
1.3046837
1.300348
1.2976832
1.2957871
1.2945627
1.2937343
1.2931586
...
)
;

boundaryField
{
    Side
    {
        type            empty;
    }
    Inlet
    {
        type            inletOutlet;
        inletValue      uniform 1.29;
        value           nonuniform List<scalar> 
300
(
1.29
1.29
1.29
1.29
1.29
1.29
1.29
1.29
...
)
;
    }
    Outlet
    {
        type            zeroGradient;
    }
    Flap
    {
        type            omegaWallFunction;
        value           nonuniform List<scalar> 
107
(
2404778.2
2876747.2
2815141.9
2649756.3
2582187.5
2419103.1
2282902.5
2169850.2
...
)
;
    }
    Airfoil
    {
        type            omegaWallFunction;
        value           nonuniform List<scalar> 
176
(
159646.9
152874.6
148210.83
146425.48
145610.2
144460.74
146717.61
148647.09
...
)
;
    }
}


// ************************************************************************* //
