data_assignment/foam_cases/6_deg_coarse/0/omega_0
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      omega_0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
19794
(
1.3099755
1.3046829
1.3003475
1.297683
1.295787
1.2945627
1.2937343
1.2931586
...
)
;

boundaryField
{
    Side
    {
        type            empty;
    }
    Inlet
    {
        type            inletOutlet;
        inletValue      uniform 1.29;
        value           nonuniform List<scalar> 
300
(
1.29
1.29
1.29
1.29
1.29
1.29
1.29
1.29
...
)
;
    }
    Outlet
    {
        type            zeroGradient;
    }
    Flap
    {
        type            omegaWallFunction;
        blending        binomial;
        n               2;
        value           nonuniform List<scalar> 
107
(
2404776.4
2876744.7
2815141.7
2649756.4
2582188
2419103.8
2282903.3
2169851
...
)
;
    }
    Airfoil
    {
        type            omegaWallFunction;
        blending        binomial;
        n               2;
        value           nonuniform List<scalar> 
176
(
159646.82
152874.54
148210.78
146425.45
145610.18
144460.72
146717.6
148647.09
...
)
;
    }
}


// ************************************************************************* //
