data_assignment/foam_cases/6_deg_coarse/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
19794
(
101239.82
101264.44
101287.98
101309.81
101328.98
101346.02
101361.97
101376.59
...
)
;

boundaryField
{
    Side
    {
        type            empty;
    }
    Inlet
    {
        type            freestreamPressure;
        freestreamValue uniform 101325;
        value           nonuniform List<scalar> 
300
(
101271.57
101284.85
101299.24
101313.97
101328
101341.39
101354.71
101367.58
...
)
;
    }
    Outlet
    {
        type            zeroGradient;
    }
    Flap
    {
        type            zeroGradient;
    }
    Airfoil
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
