data_assignment/foam_cases/6_deg_coarse/0/pMean
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      pMean;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
19794
(
101227.4
101242.06
101257.92
101274.59
101291.17
101307.36
101323.02
101338.08
...
)
;

boundaryField
{
    Side
    {
        type            empty;
    }
    Inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
300
(
101263.51
101269.76
101278.1
101288.23
101299.36
101311.16
101323.35
101335.76
...
)
;
    }
    Outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
135
(
101314.51
101322.12
101320.13
101322.08
101322.29
101323.2
101323.68
101324.26
...
)
;
    }
    Flap
    {
        type            calculated;
        value           nonuniform List<scalar> 
107
(
101009.3
101755.47
102332.11
102437.78
102794.88
102920.47
102987.8
103069.91
...
)
;
    }
    Airfoil
    {
        type            calculated;
        value           nonuniform List<scalar> 
176
(
103017.95
103013.06
103009.22
103013.85
103020.14
103025.61
103033.42
103038.93
...
)
;
    }
}


// ************************************************************************* //
