data_assignment/foam_cases/6_deg_coarse/0/p_0
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      p_0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
19794
(
101239.83
101264.45
101287.98
101309.81
101328.97
101346
101361.95
101376.57
...
)
;

boundaryField
{
    Side
    {
        type            empty;
    }
    Inlet
    {
        type            freestreamPressure;
        freestreamValue uniform 101325;
        value           nonuniform List<scalar> 
300
(
101271.58
101284.86
101299.24
101313.97
101327.99
101341.38
101354.69
101367.56
...
)
;
    }
    Outlet
    {
        type            zeroGradient;
    }
    Flap
    {
        type            zeroGradient;
    }
    Airfoil
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
