data_assignment/foam_cases/6_deg_coarse/0/rho
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
19794
(
1.2011081
1.2014024
1.2016734
1.2019164
1.2021287
1.2023167
1.2024958
1.2026618
...
)
;

boundaryField
{
    Side
    {
        type            empty;
    }
    Inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
300
(
1.2013877
1.2015453
1.2017159
1.2018907
1.2020572
1.202216
1.202374
1.2025267
...
)
;
    }
    Outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
135
(
1.2017063
1.2018295
1.2017014
1.2016125
1.2015734
1.201537
1.2015175
1.2014967
...
)
;
    }
    Flap
    {
        type            calculated;
        value           nonuniform List<scalar> 
107
(
1.2031974
1.2038015
1.2114022
1.2116105
1.2146583
1.2164708
1.2166368
1.2175298
...
)
;
    }
    Airfoil
    {
        type            calculated;
        value           nonuniform List<scalar> 
176
(
1.2181347
1.2181826
1.2186679
1.2186692
1.2185006
1.2187422
1.2186584
1.2187407
...
)
;
    }
}


// ************************************************************************* //
