data_assignment/foam_cases/6_deg_coarse/0/rho_0
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      rho_0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
19794
(
1.2011082
1.2014025
1.2016734
1.2019164
1.2021286
1.2023166
1.2024956
1.2026615
...
)
;

boundaryField
{
    Side
    {
        type            empty;
    }
    Inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
300
(
1.2013878
1.2015454
1.2017159
1.2018907
1.2020571
1.2022159
1.2023738
1.2025265
...
)
;
    }
    Outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
135
(
1.2017064
1.2018296
1.2017015
1.2016126
1.2015735
1.2015371
1.2015177
1.2014969
...
)
;
    }
    Flap
    {
        type            calculated;
        value           nonuniform List<scalar> 
107
(
1.2031973
1.2038012
1.2114018
1.2116101
1.2146579
1.2164703
1.2166363
1.2175294
...
)
;
    }
    Airfoil
    {
        type            calculated;
        value           nonuniform List<scalar> 
176
(
1.2181344
1.2181823
1.2186676
1.2186689
1.2185004
1.218742
1.2186582
1.2187404
...
)
;
    }
}


// ************************************************************************* //
