data_assignment/foam_cases/6_deg_coarse/0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    Side
    {
        type            empty;
    }
    Inlet
    {
        type            calculated;
        value           uniform 0;
    }
    Outlet
    {
        type            calculated;
        value           uniform 0;
    }
    Flap
    {
        type            calculated;
        value           nonuniform List<scalar> 
107
(
4.7709233
7.0244263
5.9766917
5.4897635
5.3274771
4.9515938
4.9005181
4.9045303
...
)
;
    }
    Airfoil
    {
        type            calculated;
        value           nonuniform List<scalar> 
176
(
17.029253
15.623486
14.505205
13.476806
12.621104
11.899827
11.411673
11.268878
...
)
;
    }
}


// ************************************************************************* //
