data_assignment/foam_cases/6_deg_coarse/system/first_order_start/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-7;
        relTol          0.01;
        minIter         3;
    }

    pFinal
    {
        $p;
        tolerance       1e-13;
        relTol          0;
    }

    "(rho|U|k|omega|e)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-7;
        relTol          0.0;
    }

    "(rho|U|k|omega|e)Final"
    {
        $U;
        tolerance       1e-13;
        relTol          0;
    }
}

SIMPLE
{
    residualControl
    {
        p               1e-13;
        U               1e-13;
        "(k|omega|e)"   1e-13;
    }

    nNonOrthogonalCorrectors 2;
    pMinFactor      0.1;
    pMaxFactor      2;
}

PIMPLE
{
    nCorrectors              2;
//     nNonOrthogonalCorrectors 3; // non-ortho 70 - 85
    nNonOrthogonalCorrectors 2; // non-ortho 60 - 70
//     nNonOrthogonalCorrectors 1; // non-ortho <60
    nOuterCorrectors         1;
    pMinFactor      0.1;
    pMaxFactor      2;
//     momentumPredictor yes;
}

relaxationFactors
{
    fields
    {
        p               0.7;
        rho             0.7;
    }
    equations
    {
        U               0.7;
        e               0.7;
        "(k|omega)"     0.7;
    }
}


// ************************************************************************* //
